{
  "sections": {
    "Open Reflection": {
      "description": "General thoughts, daily reflections, or free-form journaling content that doesn't fit into more specific sections. May appear under titles like 'Daily Notes', 'Journal', 'Reflection', or without a specific header at the start of an entry.",
      "aliases": ["Daily Notes", "Journal", "Reflection", "General"]
    },
    "Emotional State": {
      "description": "Content describing mood, feelings, stress levels, or well-being. Often includes a rating (e.g., X out of 5) and reasons for the rating.",
      "aliases": ["Mood", "Feelings", "Well-being"]
    },
    "Trading Journal": {
      "description": "Details of specific trades made, positions opened or closed, entry and exit points, profit/loss for trades, and specific trading activities.",
      "aliases": ["Trades", "Positions", "Trading Activity"]
    },
    "Market Thoughts": {
      "description": "Broader analysis of market trends, specific assets (like Bitcoin, SPX), macroeconomic views, market sentiment, or potential future market movements. This is distinct from specific trades.",
      "aliases": ["Market Analysis", "Market Commentary", "Asset Analysis", "Market Outlook"]
    },
    "Strategy Considerations": {
       "description": "High-level trading or investment strategy thoughts, adjustments, or planning. This can include thoughts on asset allocation, risk management, or overall approach (distinct from specific 'Market Thoughts' on current conditions).",
       "aliases": ["Strategy", "Positioning", "Approach", "Game Plan"]
     },
    "Weekly Review": {
       "description": "Summary of accomplishments, progress, tasks completed, or significant events from the past week. Often a list of what was done.",
       "aliases": ["Accomplishments", "Review", "What was accomplished", "Progress"]
     },
    "Goals for Next Week": {
       "description": "Plans, tasks, or objectives set for the upcoming week. Often a list of actionable items.",
       "aliases": ["Next Steps", "Objectives", "Tasks for Next Week", "Plans"]
     },
    "Things I'm Grateful For": {
       "description": "Specific expressions of gratitude, appreciation, or positive acknowledgements.",
       "aliases": ["Gratitude", "Grateful For"]
     },
    "Questions for Future Self": {
        "description": "Questions posed by the user for their future self to reflect upon or to track progress on certain topics.",
        "aliases": ["Future Questions", "Questions to Self"]
     }
  },
  "last_updated": "2024-05-12T12:00:00Z"
} 